code-review/NRB_3471_3546/База_Было/DataProcessors/ФиксацияКорпоративныхДействийВСообщенияхКД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ФиксацияКорпоративныхДействийВСообщенияхКД</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеСообщения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПериодНомераСообщенияИсходного</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КД</Name>
							<Comment>(Карточка КД)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.РаскрытиеСпискаВладельцев</v8:Type>
								<v8:Type>cfg:DocumentRef.КорпоративноеДействие_Новый</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КДРеференс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньВыборки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКорпоративныхДействий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособУведомления</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыУведомления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаФиксации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦеннаяБумага2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦенныеБумаги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСообщенияИсходный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапКД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭтапыКД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/DataProcessors/ФиксацияКорпоративныхДействийВСообщенияхКД/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗафиксироватьСообщения(Команда)
	ЗафиксироватьСообщенияСервер();
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьСообщенияСервер()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ЗафиксироватьСообщенияКД(Объект.ДатаНач, Объект.ДатаКон, Объект.ВремяЗаписи);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаНач = ТекущаяДата();
	Объект.ДатаКон = ТекущаяДата();
	Объект.ВремяЗаписи = ТекущаяДата();
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Период = Новый СтандартныйПериод(Объект.ДатаНач,  ?(Объект.ДатаКон=Дата("00010101"), Объект.ДатаКон, КонецДня(Объект.ДатаКон)));
	Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог.Период = Период;
	Если Диалог.Редактировать() Тогда 
		Объект.ДатаНач = Диалог.Период.ДатаНачала;
		Объект.ДатаКон = Диалог.Период.ДатаОкончания;
	КонецЕсли; 
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанные(Команда)
	ПолучитьДанныеСервер();
КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеСервер()
	мОбъект = РеквизитФормыВЗначение("Объект");
	мОбъект.ПолучитьДанные(Объект.ДатаНач, Объект.ДатаКон);
	ЗначениеВРеквизитФормы(мОбъект, "Объект");
КонецПроцедуры
